import math
masRu =[0.145,0.095,0.074,0.064,0.064,0.056, 0.056, 0.047, 0.041, 0.039, 0.036, 0.029, 0.026, 0.026, 0.024, 0.021, 0.019,0.009,0.016,0.008,0.015,0.007,0.015,0.006,0.015,0.004,0.014,0.003,0.013,0.003,0.010,0.002]
masFr = [7.68,0.80,3.32,3.60,17.76,1.06,1.10,0.64,7.23,0.19,5.89,2.72,7.61,5.34,3.24,1.34,6.81,8.23,7.30,6.05,1.27,0.54,0.21,0.07]
masGe =[5.52,1.56,2.94,4.91,19.18,1.96,3.60,5.02,8.21,0.16,1.33,3.48,1.69,10.20,2.14,0.54,0.01,7.01,7.07,5.86,4.22,0.84,1.38,1.17]
masEn = [7.96,1.60,2.84,4.01,12.86,2.62,1.99,5.39,7.77,0.16,0.41,3.51,2.43,7.51,6.62,1.81,0.17,6.83,6.62,9.72,2.48,1.15,1.80,0.17,1.52,0.05]
masEs =[12.90,1.03,4.42,4.67,14.15,0.70,1.00,0.91,7.01,0.24,5.52,2.55,6.20,8.84,3.26,1.55,6.95,7.64,4.36,4.00,0.67,0.07,1.05,0.31]
masIt = [11.12,1.07,4.11,3.54,11.63,1.15,1.73,0.83,12.04,5.95,2.65,7.68,8.92,2.66,0.48,6.56,4.81,7.07,3.09,1.67,1.24]
HRu = HFr = HGe = HEn = HEs = HIt = 0
for i in masRu:
    HRu -= i*math.log(i,2)
for i in masFr:
    HFr -= i*math.log(i/100,2)/100
for i in masGe:
    HGe -= i*math.log(i/100,2)/100
for i in masEn:
    HEn -= i*math.log(i/100,2)/100
for i in masEs:
    HEs -= i*math.log(i/100,2)/100
for i in masIt:
    HIt -= i*math.log(i/100,2)/100


print('Энтропия для русского алфавита',HRu)
print('Энтропия для немецкого алфавита',HGe)
print('Энтропия для французского алфавита',HFr)
print('Энтропия для английского алфавита',HEn)
print('Энтропия для испанского алфавита',HEs)
print('Энтропия для итальянского алфавита',HIt)



